/**
* @mainpage
* <b> Розрахункове завдання. <br/></b>
* <b><i> Індивідуальне завдання: Визначити, хто із студентів за результатами сесії має заборгованості і який % становлять їх заборгованості з програмування </i></b><br/>
* @author Tatarenko Andrey
* @date 2020.06.16
* @version 1.0
*/

/**
* @file main.cpp
* Файл реалізації методів класу Menu
*/

#include "list.h" /** Підключення файлу list.h */
#include "Menu.h" /** Підключення файлу Menu.h */
#include "FuncTester.h" /** Підключення файлу FuncTester.h */

void main()
{
	setlocale(LC_ALL, "ru"); /** Русифікація консолі */
	Menu menu; /** Створення змінної класу Menu */

	menu.menu(); /** Виклик методу меню */

	cout << endl << "Тестирование функций с помощью класса-тестировщика" << endl;
	FuncTester tester; /** Створення змінної класу FuncTester */
	tester.ReadFile_Test(); /** Виклик методу тестування методу читання файлу */
	tester.Add_Test(); /** Виклик методу тестування методу додавання елементів */
	tester.Delete_Test(); /** Виклик методу тестування методу видалення елементів */
	tester.SaveFile_Test(); /** Виклик методу тестування методу виведення даних у файл */
	tester.Sort_Test(); /** Виклик методу тестування методу сортування */
	tester.Task_Test(); /** Виклик методу тестування методу виконання індивідуального завдання */
	tester.~FuncTester();

	if (_CrtDumpMemoryLeaks()) /** Перевірка витоків пам'яті */
		cout << endl << "Есть утечка памяти." << endl; /** Виведення повідомленя якщо витоки є */
	else
		cout << endl << "Утечка памяти отсутствует." << endl; /** Виведення повідомленя якщо витоків немає */

	system("PAUSE"); /** Зупинка роботи програми */
	return; /** Завершення роботи програми */
}